PWr-Aerospace/CanSatOBC/bsp/system/startup_stm32h533vetx.s
	.weak	CRS_IRQHandler
	.thumb_set CRS_IRQHandler,Default_Handler

	.weak	UCPD1_IRQHandler
	.thumb_set UCPD1_IRQHandler,Default_Handler

	.weak	FMC_IRQHandler
	.thumb_set FMC_IRQHandler,Default_Handler

	.weak	OCTOSPI1_IRQHandler
	.thumb_set OCTOSPI1_IRQHandler,Default_Handler

	.weak	SDMMC1_IRQHandler
	.thumb_set SDMMC1_IRQHandler,Default_Handler

	.weak	I2C3_EV_IRQHandler
	.thumb_set I2C3_EV_IRQHandler,Default_Handler

	.weak	I2C3_ERR_IRQHandler
	.thumb_set I2C3_ERR_IRQHandler,Default_Handler

	.weak	SPI4_IRQHandler
	.thumb_set SPI4_IRQHandler,Default_Handler

	.weak	USART6_IRQHandler
	.thumb_set USART6_IRQHandler,Default_Handler

	.weak	GPDMA2_CH0_IRQHandler
	.thumb_set GPDMA2_CH0_IRQHandler,Default_Handler

	.weak	GPDMA2_CH1_IRQHandler
	.thumb_set GPDMA2_CH1_IRQHandler,Default_Handler

	.weak	GPDMA2_CH2_IRQHandler
	.thumb_set GPDMA2_CH2_IRQHandler,Default_Handler

	.weak	GPDMA2_CH3_IRQHandler
	.thumb_set GPDMA2_CH3_IRQHandler,Default_Handler

	.weak	GPDMA2_CH4_IRQHandler
	.thumb_set GPDMA2_CH4_IRQHandler,Default_Handler

	.weak	GPDMA2_CH5_IRQHandler
	.thumb_set GPDMA2_CH5_IRQHandler,Default_Handler

	.weak	GPDMA2_CH6_IRQHandler
	.thumb_set GPDMA2_CH6_IRQHandler,Default_Handler

	.weak	GPDMA2_CH7_IRQHandler
	.thumb_set GPDMA2_CH7_IRQHandler,Default_Handler

	.weak	FPU_IRQHandler
	.thumb_set FPU_IRQHandler,Default_Handler

	.weak	ICACHE_IRQHandler
	.thumb_set ICACHE_IRQHandler,Default_Handler

	.weak	DCACHE_IRQHandler
	.thumb_set DCACHE_IRQHandler,Default_Handler

	.weak	DCMI_PSSI_IRQHandler
	.thumb_set DCMI_PSSI_IRQHandler,Default_Handler

	.weak	FDCAN2_IT0_IRQHandler
	.thumb_set FDCAN2_IT0_IRQHandler,Default_Handler

	.weak	FDCAN2_IT1_IRQHandler
	.thumb_set FDCAN2_IT1_IRQHandler,Default_Handler

	.weak	DTS_OR_DTS_WKUP_IRQHandler
	.thumb_set DTS_OR_DTS_WKUP_IRQHandler,Default_Handler

	.weak	RNG_IRQHandler
	.thumb_set RNG_IRQHandler,Default_Handler

	.weak	OTFDEC1_IRQHandler
	.thumb_set OTFDEC1_IRQHandler,Default_Handler

	.weak	AES_IRQHandler
	.thumb_set AES_IRQHandler,Default_Handler

	.weak	HASH_IRQHandler
	.thumb_set HASH_IRQHandler,Default_Handler

	.weak	PKA_IRQHandler
	.thumb_set PKA_IRQHandler,Default_Handler

	.weak	CEC_IRQHandler
	.thumb_set CEC_IRQHandler,Default_Handler

	.weak	TIM12_IRQHandler
	.thumb_set TIM12_IRQHandler,Default_Handler

	.weak	I3C1_EV_IRQHandler
	.thumb_set I3C1_EV_IRQHandler,Default_Handler

	.weak	I3C1_ERR_IRQHandler
	.thumb_set I3C1_ERR_IRQHandler,Default_Handler

	.weak	I3C2_EV_IRQHandler
	.thumb_set I3C2_EV_IRQHandler,Default_Handler

	.weak	I3C2_ERR_IRQHandler
	.thumb_set I3C2_ERR_IRQHandler,Default_Handler

	.weak	SystemInit

/************************ (C) COPYRIGHT STMicroelectonics *****END OF FILE****/
